# 0324

Related links

- [Course website](https://www-math.nsysu.edu.tw/~chlin/2025SMath599/2025SMath599.html)
- [Python Data Science Handbook](https://jakevdp.github.io/PythonDataScienceHandbook/)

## Data

In [1]:
### load nsysu

import os
import urllib
import numpy as np

base = r"https://github.com/SageLabTW/auto-grading/raw/master/nsysu-digits/"
for c in ['X', 'y']:
    filename = "nsysu-digits-%s.csv"%c
    if filename not in os.listdir('.'):
        print(filename, 'not found --- will download')
        urllib.request.urlretrieve(base + c + ".csv", filename)

Xsys = np.genfromtxt('nsysu-digits-X.csv', dtype=int, delimiter=',') ### flattened already
ysys = np.genfromtxt('nsysu-digits-y.csv', dtype=int, delimiter=',')

In [2]:
# load MNIST (long)

from sklearn.datasets import fetch_openml
mnist = fetch_openml('mnist_784')

[Sample DataFrame](https://docs.google.com/spreadsheets/d/1pzcuTVMyRhBrwmcpOnGILUjMsPeF8fjkSSLwUuevXJ0/edit?usp=sharing)

In [3]:
from sklearn import datasets
titanic = datasets.fetch_openml(name='titanic', version=1, as_frame=True)

In [4]:
# required packages
import numpy as np
import pandas as pd

## [Pivot Tables](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html)

[Sample DataFrame](https://docs.google.com/spreadsheets/d/1pzcuTVMyRhBrwmcpOnGILUjMsPeF8fjkSSLwUuevXJ0/edit?usp=sharing)

By Google spreadsheet

In [5]:
df = pd.read_csv("pivot.csv").set_index("STD_ID")
df.head()

       GENDER  YEAR  SCORE
STD_ID
1           M     1     42
2           M     1     18
3           M     1     32
4           F     1    100
5           F     1     14

In [6]:
# by GroupBy ~ split + apply + combine
df.groupby(["GENDER","YEAR"]).mean()

                 SCORE
GENDER YEAR
F      1     57.000000
       2     48.666667
       3     42.500000
       4     28.000000
M      1     30.666667
       2     59.000000
       3     92.000000
       4     42.750000

In [7]:
df.groupby(["GENDER","YEAR"]).mean().unstack()

            SCORE
YEAR            1          2     3      4
GENDER
F       57.000000  48.666667  42.5  28.00
M       30.666667  59.000000  92.0  42.75

In [8]:
# by pivot_table
df.pivot_table(values="SCORE", index="GENDER", columns="YEAR", aggfunc='mean')

YEAR            1          2     3      4
GENDER
F       57.000000  48.666667  42.5  28.00
M       30.666667  59.000000  92.0  42.75

Try Titanic

In [9]:
titanic.keys()

dict_keys(['data', 'target', 'frame', 'categories', 'feature_names', 'target_names', 'DESCR', 'details', 'url'])

In [10]:
X = titanic["data"]
y = titanic["target"]
X["survive"] = y.astype(float)
X.head()

,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,survive
0,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",1.0
1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",1.0
2,1,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",0.0
3,1,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",0.0
4,1,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",0.0

In [11]:
# pivot by gender and class
X.pivot_table(values="survive", index="sex", columns="pclass")

C:\Users\User\AppData\Local\Temp\ipykernel_15660\2169408131.py:2: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  X.pivot_table(values="survive", index="sex", columns="pclass")

pclass         1         2         3
sex
female  0.965278  0.886792  0.490741
male    0.340782  0.146199  0.152130

In [12]:
# cut by age
by_age = pd.cut(X["age"], [0, 18, 80])
X.pivot_table(values="survive", index="sex", columns=by_age)

C:\Users\User\AppData\Local\Temp\ipykernel_15660\3269047658.py:3: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  X.pivot_table(values="survive", index="sex", columns=by_age)

age      (0, 18]  (18, 80]
sex
female  0.684783  0.773649
male    0.316832  0.184919

In [13]:
X.pivot_table(values="survive", index=["sex", by_age], columns="pclass")

C:\Users\User\AppData\Local\Temp\ipykernel_15660\601541375.py:1: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  X.pivot_table(values="survive", index=["sex", by_age], columns="pclass")

pclass                  1         2         3
sex    age
female (0, 18]   0.923077  0.952381  0.534483
       (18, 80]  0.966667  0.878049  0.436170
male   (0, 18]   0.750000  0.523810  0.208333
       (18, 80]  0.328671  0.087591  0.158845

Read [Example: Birthrate Data](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html#Example:-Birthrate-Data)

## [Vectorized String Operations](https://jakevdp.github.io/PythonDataScienceHandbook/03.10-working-with-strings.html)

operations to a string

In [14]:
s = "apple"

In [15]:
s.upper()

'APPLE'

In [16]:
s.capitalize()

'Apple'

In [17]:
s.startswith("app")

True

In [18]:
s.replace("p", "b")

'abble'

apply string operations to a Series

In [19]:
# list comprehension 列表表達式
# set-builder notation {x**2: x is prime}
data = ['peter', 'Paul', 'MARY', 'gUIDO']
[name.capitalize() for name in data]

['Peter', 'Paul', 'Mary', 'Guido']

In [20]:
# slow
# trouble from None
data = ['peter', 'Paul', 'MARY', None, 'gUIDO']
[name.capitalize() for name in data]

AttributeError: 'NoneType' object has no attribute 'capitalize'

In [ ]:
# Series string method
data = ['peter', 'Paul', 'MARY', None, 'gUIDO']
s = pd.Series(data)
s.str.capitalize()

0    Peter
1     Paul
2     Mary
3     None
4    Guido
dtype: object

[List of string methods](https://jakevdp.github.io/PythonDataScienceHandbook/03.10-working-with-strings.html#Methods-similar-to-Python-string-methods)

In [ ]:
# find HW by startswith
s = pd.Series(["HW%s"%i for i in range(1, 6)] + 
              ["Exam%s"%i for i in range(1, 4)])
print(s)
print(s.str.startswith("HW"))

0      HW1
1      HW2
2      HW3
3      HW4
4      HW5
5    Exam1
6    Exam2
7    Exam3
dtype: object
0     True
1     True
2     True
3     True
4     True
5    False
6    False
7    False
dtype: bool

In [ ]:
stg = "apple"
stg[1:4]

'ppl'

In [ ]:
# str[...]
s[s.str.startswith("HW")].str[-1]

0    1
1    2
2    3
3    4
4    5
dtype: object

In [ ]:
# str.get
s.str.get(0)

0    H
1    H
2    H
3    H
4    H
5    E
6    E
7    E
dtype: object

Regular expression  
正則表達式

Python `re` module

- [doc](https://docs.python.org/3/library/re.html)
- `.`: any character
- `?`: 0 or 1 times, `*`: 0+ times, `+`: 1+ times, `{m,n}`: from m to n
- `[A-Z]`: capital letters; `[0-9]`: numbers

In [ ]:
import re

In [ ]:
# 左邊的 pattern 有沒有在右邊的字串的 "開頭" 就出現
re.match("[A-Z][0-9]{9}", "B122040123")

In [ ]:
re.match("s+", "")

In [ ]:
# HW1 ~ HW 30
re.match("HW[0-9]{1,2}", "HW15")

- match: 從開頭確認是否符合
- search: 搜尋全文 --> 吐出 match object
- findall: 搜尋全文 --> 吐出文字

In [ ]:
# match, search, findall, replace

`re.match` ~ `str.match`

In [ ]:
s = pd.Series(["HW%s"%i for i in range(1, 6)] + 
              ["Exam%s"%i for i in range(1, 4)])
print(s)
s.str.match("HW")

0      HW1
1      HW2
2      HW3
3      HW4
4      HW5
5    Exam1
6    Exam2
7    Exam3
dtype: object

0     True
1     True
2     True
3     True
4     True
5    False
6    False
7    False
dtype: bool

`re.search` ~ `str.contains`

[Miscellaneous methods](https://jakevdp.github.io/PythonDataScienceHandbook/03.10-working-with-strings.html#Miscellaneous-methods)

Read [Example: Recipe Database](https://jakevdp.github.io/PythonDataScienceHandbook/03.10-working-with-strings.html#Example:-Recipe-Database)

## [Working with Time Series](https://jakevdp.github.io/PythonDataScienceHandbook/03.11-working-with-time-series.html)

- Time stamp: March 24, 2025
- Time interval: from mmdd to mmdd
- Time delta: 10 days

Python `datetime` module

In [ ]:
# object
from datetime import datetime
datetime(year=2015, month=7, day=4)

datetime.datetime(2015, 7, 4, 0, 0)

In [ ]:
# parse
from dateutil import parser
date = parser.parse("4th of July, 2015")
date

datetime.datetime(2015, 7, 4, 0, 0)

In [ ]:
# output formatting
date.strftime('%A')

'Saturday'

See [datetime documentation](https://docs.python.org/3/library/datetime.html#strftime-and-strptime-behavior)

NumPy `datetime64`

In [ ]:
# today (yyyy-mm-dd)
d = np.datetime64(datetime.now().strftime("%Y-%m-%d"))
print(d)

2025-03-24

In [ ]:
# datetime broadcasting
d + np.arange(1,10,2)

array(['2025-03-25', '2025-03-27', '2025-03-29', '2025-03-31',
       '2025-04-02'], dtype='datetime64[D]')

pandas

In [ ]:
# pd.to_date_time ~ parser.parse
pd.to_datetime("March 4th, 2025")

Timestamp('2025-03-04 00:00:00')

In [ ]:
# pd.to_timedelta
pd.to_timedelta(1,"D")

Timedelta('1 days 00:00:00')

Time as index

In [ ]:
# time stamp + time deltas
print(d)
print(d + pd.to_timedelta(1,"D"))

2025-03-24
2025-03-25 00:00:00

In [ ]:
# pd.date_range
pd.date_range("Feb 28, 2025","Mar 7, 2025")

DatetimeIndex(['2025-02-28', '2025-03-01', '2025-03-02', '2025-03-03',
               '2025-03-04', '2025-03-05', '2025-03-06', '2025-03-07'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
# periods and freq
pd.date_range("Feb 28, 2025", periods=10)

DatetimeIndex(['2025-02-28', '2025-03-01', '2025-03-02', '2025-03-03',
               '2025-03-04', '2025-03-05', '2025-03-06', '2025-03-07',
               '2025-03-08', '2025-03-09'],
              dtype='datetime64[ns]', freq='D')

Financial applications

See [pandas-data-reader documentation](https://pandas-datareader.readthedocs.io/en/latest/index.html)

In [ ]:
from pandas_datareader import data

gs10 = data.DataReader('GS10', 'fred')
gs10.head()

ModuleNotFoundError: No module named 'pandas_datareader'

Read [Resampling and converting frequencies](https://jakevdp.github.io/PythonDataScienceHandbook/03.11-working-with-time-series.html#Resampling-and-converting-frequencies)

Read [Example: Visualizing Seattle Bicycle Counts](https://jakevdp.github.io/PythonDataScienceHandbook/03.11-working-with-time-series.html#Example:-Visualizing-Seattle-Bicycle-Counts)

## [High-Performance Pandas: eval() and query()](https://jakevdp.github.io/PythonDataScienceHandbook/03.12-performance-eval-and-query.html)

`numexpr.evaluate`

In [21]:
x = np.random.randn(1000000)
y = np.random.randn(1000000)

In [22]:
%%timeit
(x + 1) + (y - 1)

8.6 ms ± 341 μs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [23]:
import numexpr as ne

ModuleNotFoundError: No module named 'numexpr'

In [45]:
%%timeit
ne.evaluate("(x + 1) + (y - 1)")

NameError: name 'ne' is not defined

`df.eval`

In [46]:
df = pd.DataFrame({
    "x": x,
    "y": y
})

In [47]:
df.eval("(x + 1) + (y - 1)")

0        -1.114487
1        -0.674886
2         3.679832
3         0.556736
4         0.335393
            ...
999995   -2.350472
999996    2.138557
999997   -1.495005
999998   -1.165048
999999   -1.784983
Length: 1000000, dtype: float64

`df.query`

In [48]:
df.query("x > 0.5 and y < 0.5")

               x         y
1       0.732898 -1.407784
6       1.075419 -0.747194
8       0.969169  0.482109
13      1.619156 -0.921817
18      0.924048  0.251489
...          ...       ...
999979  0.941915 -1.606676
999984  1.188906 -0.664243
999986  2.118382  0.344125
999992  1.063390  0.425321
999993  1.023717 -0.000227

[213009 rows x 2 columns]

## [Further Resources](https://jakevdp.github.io/PythonDataScienceHandbook/03.13-further-resources.html)

## Homework

- Type your answers here and submit your answer in `*.ipynb` format.
- You may use code cell and Markdown cell.

In [49]:
NAME = "李瑋宸" # change to your name
STD_ID = "B123245008" # change to your student ID
print("My name is %s and my student ID is %s."%(NAME, STD_ID))

My name is 李瑋宸 and my student ID is B123245008.

### Exercise 1: Creating a Pivot Table
Given the following DataFrame:

```python
import pandas as pd

data = {
    'Department': ['HR', 'HR', 'IT', 'IT', 'Finance', 'Finance'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank'],
    'Month': ['Jan', 'Jan', 'Feb', 'Feb', 'Jan', 'Feb'],
    'Salary': [5000, 5500, 6000, 6500, 7000, 7200]
}
df = pd.DataFrame(data)
```

Create a pivot table showing average salary by `Department` and `Month`.

In [50]:
import pandas as pd

data = {
    'Department': ['HR', 'HR', 'IT', 'IT', 'Finance', 'Finance'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank'],
    'Month': ['Jan', 'Jan', 'Feb', 'Feb', 'Jan', 'Feb'],
    'Salary': [5000, 5500, 6000, 6500, 7000, 7200]
}
df = pd.DataFrame(data)
print(df.pivot_table(values="Salary",index="Department",columns="Month"))

Month          Feb     Jan
Department
Finance     7200.0  7000.0
HR             NaN  5250.0
IT          6250.0     NaN

### Exercise 2: Pivot Table Aggregations
Modify the pivot table to display both `mean` and `max` salary values using the `aggfunc` parameter.

In [51]:
print(df.pivot_table(values="Salary",index="Department",columns="Month",aggfunc=["mean","max"]))

              mean             max
Month          Feb     Jan     Feb     Jan
Department
Finance     7200.0  7000.0  7200.0  7000.0
HR             NaN  5250.0     NaN  5500.0
IT          6250.0     NaN  6500.0     NaN

### Exercise 3: String Methods
Create a Series of names:

```python
names = pd.Series(['alice', 'BOB', 'Charlie', 'david'])
```

Convert all names to title case (first letter uppercase, rest lowercase).

In [52]:
names = pd.Series(['alice', 'BOB', 'Charlie', 'david'])
names.str.title()

0      Alice
1        Bob
2    Charlie
3      David
dtype: object

### Exercise 4: String Filtering
Using the same `names` Series, filter the names that start with the letter `C` (case-insensitive).

In [53]:
names[names.str.startswith("C")]

2    Charlie
dtype: object

### Exercise 5: Extracting and Replacing Strings
Given the following Series:

```python
emails = pd.Series(['alice@example.com', 'bob@gmail.com', 'charlie@yahoo.com'])
```

Extract the domain name from each email and replace `yahoo.com` with `outlook.com`.

In [54]:
emails = pd.Series(['alice@example.com', 'bob@gmail.com', 'charlie@yahoo.com'])
emails.str.replace("yahoo.com","outlook.com")

0      alice@example.com
1          bob@gmail.com
2    charlie@outlook.com
dtype: object

### Exercise 6: Creating Time Series
Create a date range starting from `2023-01-01` with 10 daily periods. Generate a Series of random integers indexed by this date range.

In [55]:
import numpy as np
d = np.datetime64("2023-01-01")
print(d + np.arange(10),"\n")
date_arr = d + np.arange(10)
date_arr2 = pd.date_range(d,periods=10)
print(date_arr2,"\n")

arr = np.random.randint(0,101,10)

df = pd.DataFrame(data=arr,index=date_arr,columns=["Num"])
print(df,"\n")

s = pd.Series(arr,index = date_arr2)
print(s)

['2023-01-01' '2023-01-02' '2023-01-03' '2023-01-04' '2023-01-05'
 '2023-01-06' '2023-01-07' '2023-01-08' '2023-01-09' '2023-01-10']

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10'],
              dtype='datetime64[ns]', freq='D')

            Num
2023-01-01   98
2023-01-02   11
2023-01-03   45
2023-01-04    0
2023-01-05   97
2023-01-06   17
2023-01-07   55
2023-01-08   36
2023-01-09   81
2023-01-10   47

2023-01-01    98
2023-01-02    11
2023-01-03    45
2023-01-04     0
2023-01-05    97
2023-01-06    17
2023-01-07    55
2023-01-08    36
2023-01-09    81
2023-01-10    47
Freq: D, dtype: int32

### Exercise 7: Resampling Time Series
Resample the time series from Exercise 6 to compute weekly sums.

In [56]:
weekly_resemple = s.resample('w').sum()
print(weekly_resemple)

2023-01-01     98
2023-01-08    261
2023-01-15    128
Freq: W-SUN, dtype: int32

C:\Users\User\AppData\Local\Temp\ipykernel_15660\1479436773.py:1: FutureWarning: 'w' is deprecated and will be removed in a future version, please use 'W' instead.
  weekly_resemple = s.resample('w').sum()

### Exercise 8: Time-Based Filtering
Using the time series from Exercise 6, select all data from the first 5 days.

In [57]:
print(df[0:5])

            Num
2023-01-01   98
2023-01-02   11
2023-01-03   45
2023-01-04    0
2023-01-05   97

### Exercise 9: Using eval()
Given the following DataFrame:

```python
df = pd.DataFrame({'a': [1, 2, 3], 'b': [4, 5, 6], 'c': [7, 8, 9]})
```

Use `eval()` to compute a new column `'d'` that is the sum of `'a'` and `'b'`, divided by `'c'`.

In [58]:
df = pd.DataFrame({'a': [1, 2, 3], 'b': [4, 5, 6], 'c': [7, 8, 9]})
df['d']=df.eval("(a+b)/c")
df

   a  b  c         d
0  1  4  7  0.714286
1  2  5  8  0.875000
2  3  6  9  1.000000

### Exercise 10: Using query()
Using the same DataFrame, use `query()` to filter rows where column `b` is greater than 4 and column `c` is less than 9.

In [59]:
print(df)
df.query(" (b > 4) and (c < 9) ")

   a  b  c         d
0  1  4  7  0.714286
1  2  5  8  0.875000
2  3  6  9  1.000000

   a  b  c      d
1  2  5  8  0.875